cases/REV_tensorK_computation/DNS/0.org/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
        type            cyclic;
    }
    outlet
    {
        type            cyclic;
    }
    front
    {
        type            cyclic;
    }
    back
    {
        type            cyclic;
    }
    up
    {
        type            cyclic;
    }
    down
    {
        type            cyclic;
    }
    fibre
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    fibre1
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    fibre2
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    fibre3
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    fibre4
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
}


// ************************************************************************* //
