cases/REV_tensorK_computation/DNS/system/decomposeParDict.template
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      decomposeParDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

numberOfSubdomains |- nproc -|;


<!--(if D2)-->
method		scotch;
<!--(elif D3)-->
method          simple;
preservePatches (front back);
<!--(end)-->



simpleCoeffs
{
    n               (1 1 |- nproc -|);
    delta           0.001;
}

hierarchicalCoeffs
{
    n               ( 1 1 4 );
    delta           0.001;
    order           xyz;
}

manualCoeffs
{
    dataFile        "";
}

distributed     no;

roots           ( );


// ************************************************************************* //
